import { LanguageResource } from "../LanguageResource";

export const uk: LanguageResource = {
	settings: {
		warning: {
			title: "Попередження",
			description:
				"Ви можете використовувати поля нижче для зміни обмеження на максимальну кількість пропозицій, які будуть відображатися.",
			additionalDescription:
				"Якщо залишити порожнім або встановити значення 0, обмеження буде видалено. Це не рекомендується, оскільки може негативно вплинути на продуктивність. У більших сховищах ви можете зіткнутися з аварійними завершеннями роботи програми.",
		},
		popoverLimit: {
			name: "Обмеження спливаючих підказок",
			description: "Обмеження пропозицій у спливаючих підказках.",
		},
		modalLimit: {
			name: "Обмеження для модальних вікон",
			description: "Обмеження пропозицій у модальних вікнах.",
		},
		testingPlayground: {
			title: "Тестовий майданчик",
			description: "Тестуйте змінені обмеження тут.",
			suggestDescription:
				"Щоб уникнути аварій системи, підказувачі тут відображатимуть максимум 10 000 пропозицій.",
		},
		popoverSuggestFixed: {
			name: "Фіксовані пропозиції у спливаючих підказках",
			description: "Завжди відображатиме фіксовану кількість пропозицій.",
		},
		modalSuggestFixed: {
			name: "Фіксовані пропозиції у модальних вікнах",
			description: "Завжди відображатиме фіксовану кількість пропозицій.",
			buttonText: "Відкрити",
		},
	},
};
